#'  用于存储数字的大写形式
#'
#' @return 返回值
#' @export
#'
#' @examples numUpperCase();
numUpperCase <- function() {
  res <- c(`1`='壹',
           `2`='贰',
           `3`='叁',
           `4`='肆',
           `5`='伍',
           `6`='陆',
           `7`='柒',
           `8`='捌',
           `9`='玖',
           `10`='拾',
           `100`='佰',
           `1000`='仟',
           `10000`='万',
           `100000000`='亿',
           yuan='元',
           jiao='角',
           fen='分',
           ling='零'
           );
  return(res);

}

